#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/private_server/private_server/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/private_server/private_server

To view this run in a browser, visit:
https://app.terraform.io/app/redline/private_server/runs/run-euFtCEvoNQC9oxTx

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.personal_domain: Refreshing state... [id=cee2af2644f6a3325416173e2d4b44f7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.a will be created
  + resource "cloudflare_record" "a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_record.aaaa will be created
  + resource "cloudflare_record" "aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_zone.personal_domain will be updated in-place
  ~ resource "cloudflare_zone" "personal_domain" {
      - account_id          = "e7606ece5ab8ea11e887ac95eae5b2f6" -> null
        id                  = "cee2af2644f6a3325416173e2d4b44f7"
      + verification_key    = ""
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ zone                = (sensitive)
        # (7 unchanged attributes hidden)
    }

  # hcloud_server.web will be created
  + resource "hcloud_server" "web" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-10"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = (known after apply)
      + name                       = "web"
      + rebuild_protection         = false
      + server_type                = "cpx11"
      + status                     = (known after apply)

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.


```

</details>
*Pushed by: @RedlineTriad, Action: `pull_request`*